{"posts":[{"title":"下班后的感想","text":"2025-07-29 下班后的感想，上海高物价害人。 整理自和小赵，15的QQ聊天。 今日又想去看房，但是又贵又远。还不如小酒店，遂决定不再看房了。 在上海，太难生活了。 莫名其妙感觉有点悲哀，又想到了生活成本： 我在上海住一个月，预计花费是7000￥，而在北京包括学费，一个月是1,3000￥。忽然又觉得，自己对不起这些钱了。 当意识到自己无能的时候，真的感觉有些绝望。 要是有伴就好了…… 这么想着，又吃掉了碗里最后一颗米粒。 这大概是我第三次来上海。前两次是以游客的身份，这次是以一个在这里生活的人，在上海挣扎。 估计白翊也刺激到了我，他和小赵有我很羡慕的特质——会写代码。尤其是白翊的技能变现能力，让我羡慕。道理虽然这么说：我比他年轻五岁，他能取得的成就，我假以时日，也可以凭我的时间取得。但再怎么不同，该羡慕的还得羡慕，这不是过错。 人也是会变的吧？ 公司很小，实习生也只有我一个。和借口打交道，但是看不懂文档。 晚上七点，我坐在Apple店的大型三星显示LED屏幕前。屏幕好亮，上海商圈的繁华的代表，但是繁华和我没有关系。来实习，才发现钱难挣。 我想，当面对饭菜的价格，面对房租的价格的时候，其实很多人都是会肉疼的吧？不过说到底也是猜测。 人也是神奇，有点难以想象我四个月之前在群里那么放荡，现在在上海emo。 好多人都在尽力地活着 我想到了大城市，我在短短一年时间看遍了北上广深。 大城市容下了太多人，也不在乎绝大多数人。 又忽然反应过来，大一这个学年的时间，似乎绝大多数都被浪费了。 听到我这句话，小赵反应有点大。可能这也是隔锅香的一种吧，总觉得别人干的事情就特别有意义。就像觉得别人家的饭会更好吃？ 今天下午，公司的空调开的很冷。 我就拿笔记本搭在腿上取暖。 忽觉有些可怜， 于是记录下来。 有了小赵陪伴，心情变得好了些。","link":"/2025/07/29/%E4%B8%8B%E7%8F%AD%E5%90%8E%E7%9A%84%E6%84%9F%E6%83%B3/"},{"title":"某学长的话","text":"摘自2025-07-01，北京邮电大学国际学院新生群。是的，这个学长的ID就叫“某” 前情提要：有人转发了不知道具体时间的一个，“战邮家长”的抽象聊天记录。大家正在为这个聊天记录疑惑的时候，某学长发表了看法。 400多万RMB，那就是美元60万 那不用40岁，跟我一届的比较卷的人能达到 图片已过期 夺少 当年就是这样子的，我们一起毕业，我在国内拿20万人民币，他们在美国拿20万美元 哈哈 无敌啦 真当世界一成不变呢 已经发生在我们身上的世界是一成不变的 想了解一下有没有实习的或者已经毕业的学长学姐都是去哪里实习工作啊 不少去大厂的 来个熟实习就业的老登往生存手册里加一条 刚刷到新闻，川大匹兹堡亖啦？ 就业主流就是读完研去互联网大厂咯，近几年经济下行，大家求稳，去银行、国企变多了 果园以后会不会也这样 我已经没有资格了，我放到北邮人论坛里已经属于是吃尽时代红利让后人无路可走的老登了 让我想起一个我在小红书里看到一个好几年前报电气提前批现在已经工作的人，让高三生无脑冲电气，我说强电就业局限性大，高三生最快也得四年才能就业，以后想靠电气获得稳定的工作会很卷，那人就各种说教…… 这是我2022年在新生群答疑的时候统计的我们班的就业去向： 百度产品经理、阿里码农、银行不知道干啥、AWS码农、通信写论文的、微软码农、读博未毕业专业也不明、失联、腾讯码农、世纪互联运维、银行轮岗、谷歌码农、失联（大概率不是码农）、失联、读博区块链方向、阿里码农、美国啥啥独角兽码农、银行非码农岗、养猴子的、失联、农行非码农、失联、读博专业不明、失联、搜狗码农、失联、微软苏州、野球帝、CV博士在读、字节跳动码农、交行码农、失联、失联、失联、运营商码农 @25-电管-某 野球帝？ 是的，帝哥本人是果园学生会2012级体育部部长 应该是部长吧，忘了 @25-电管-某 哦哦 这里面大家最感兴趣的就是野球帝和养猴子的。野球帝是纯纯的果园创业，12级的创始人，13级14级的主力成员。你现在翻野球帝的公众号历史文章还能翻到他回忆宏福校区。那时候属于是开个公众号就能创业的时期，学校里有想法的同学没少开公众号。 养猴子的那个，他是本科毕设接了个医疗方向的计算机视觉课题 好厉害，能获取到这么多同学的去向 于是就因为有这个背景，他申研的时候也申了这个方向 感觉我现在就和班里很多人失联了 从此他就在医疗方向一条路走到黑了 一年见2次 这里面有啥可以更新的呢，我想想…… 一个谷歌码农跳到苹果了 CV博士已经有资格招博士生了 搜狗码农由于搜狗被腾讯收购，变成腾讯码农了 有一个腾讯码农，跳槽到一家日企做推荐算法，然后由于近几年众所周知的形势，被裁员，然后同学内推去了字节 其他人我就不知道了 绝大多数人没有换工作，包括互联网公司的，包括AWS的。当年传说亚马逊流动性很大，实际这也干了五年多了没流动。 我国内就业的同学只有这一个换了工作 好稳定 失联率挺高的 （主要是是女生，人家没发朋友圈晒offer，我也不好意思问） 我们班平时发朋友圈的可能只有10个人 哦哦哦 感谢感谢 以上这是2019～2020年研究生毕业的果园人的就业具体样本。当然，现在由于经济形势，这份样本的参考价值已经大打折扣。不过至少能说明在相同时期果园的就业质量和北邮其他学院没有什么差异 好的谢谢 2022年就业报告：https://maifile.cn/est/d3276867104990/pdf2021年就业报告：https://maifile.cn/est/d2296867105600/pdf2020年就业报告：https://maifile.cn/est/d3216867105932/pdf2019年就业报告：https://maifile.cn/est/d2326867106276/pdf2018年就业报告：https://maifile.cn/est/d2216867106578/pdf2017年就业报告：https://maifile.cn/est/d2246867106902/pdf2016年就业报告：https://maifile.cn/est/d2986867107223/pdf2015年就业报告：https://maifile.cn/est/d2266867107557/pdf2014年就业报告：https://maifile.cn/est/d2276867107928/pdf2013年就业报告：https://maifile.cn/est/d3076867108283/pdf @25-电管-某 这些我能转发到招生群里吗？谢谢 北京邮电大学2023届毕业生就业质量年度报告.pdf 3.82 MB 已过期 哇哦，这么全，学校官网都下不到吧hhhh [打call][打call] 为什么没有2024届的 [表情][表情][表情] @22-智科-北邮学弟速速加我 2024只有一个微信公众号的推文 学校是不是一直没发2024届的 好像不敢发 别转野球帝，我真不记得他是谁了，怕说错了 对，那个推文数据太少了 @25-电商-乳糖不耐谢谢 怕被别的学校围攻吗 不是，北邮能发，已经很牛逼了 二四年大多数学校都不敢发就业报告 行情太烂了 23届都敢发，24届比23就业好很多吧 我记得是23届就业最烂来着 我记得就西安电子发的比较详细 @22-智科-北邮学弟速速加我 啊这 @25-电管-某 好的，非常感谢[表情][表情][表情] 2022年，虽然学校在就业质量报告里又建设西部又响应号召的，只字不提互联网公司。但是排名靠前的还是互联网 2023年… 运营商：在想我的事？ 就业史上最黑暗一年 @23-物联网-刘南府 救救代码😭 23年就是就业很烂，互联网公司招的很少 图片已过期 别问我了饱饱 我准备熬了 🤔 @22-智科-出大二笔记 挖槽北邮原来这么牛逼 @25-电商-乳糖不耐谢谢 确实 北邮的就业一直很厉害 前几天看到一个wxj的学生在小红书说 今年他知道的，总包上100万的北邮学生有十几个 那是大佬牛逼，我就算了 今年好像还出了个华为天才少年 图片已过期 大伙都太有实力了 大伙都太有实力了 图片已过期 大伙都太有实力了","link":"/2025/07/01/%E6%9F%90%E5%AD%A6%E9%95%BF%E7%9A%84%E8%AF%9D/"},{"title":"工时，时薪","text":"如果一个画师没命地画，一张画有多少收益？ 根据对某画师的观察，其一张画定价约2200人民币，已知工时约40小时。则时薪为55元。如果他一个星期有20天工作，每周工作五天，则收入也可以达到8800人民币每月。不过鉴于画画并不是容易的事情，排单密度也不可能达到这么大，根据实际的约稿条，其2025年下半年的总收入会有2,8800人民币（不含税）。 另外采访自某画师，其横向插画需耗时一星期，而一张横向插画的定价大约为7000-1,2000人民币（私人稿件）。根据倒推，假设其每日工作八小时，总收入其实也不高，而这还是圈内知名画师。 画师确实不赚钱，但也已经是非常赚钱的职业了。我领着80一天的实习工资，这么想。 北邮的招生办也是不干人事。说是很贵的学费，毕业两年就赚回来了。难道招生老师你不看税的吗？你不看现在就业市场什么鬼样吗？但说真的，这个分数能来北邮，大抵也没有更好的去处了。 有时候做梦梦见自己过上了不是和平饭店不住，不是汤臣一品不买的生活，但现实生活是住在了十几平米的酒店小楼，过着欠债上班的日子。 我倒是有个买个ipad的梦想，但是ipad也好贵啊，根本买不起。和Apple店员打太极的日子让我有了信口开河的能力。 赚钱真是不容易啊。","link":"/2025/08/03/%E5%B7%A5%E6%97%B6%EF%BC%8C%E6%97%B6%E8%96%AA/"},{"title":"梦境记录，写给北邮的情书","text":"摘自2025-07-02的和小赵的QQ聊天记录 我做了一个梦。梦见班里的女生都变得非常不可理喻。 导员护短，偏袒女生。 最后事情闹大，所有学院的学生在报告厅给北邮写感谢信，感谢北京邮电大学的悉心栽培和教导。 太荒谬了。 然后，在我写的时候，我实在是不知道该写什么。用的红笔写。所以我开始写一些人的名字，然后在横格子纸上画发抖的红色竖线。 写着写着，小赵闲着没事干，在写感谢信的时候他跑来坐我后面。 所有人都似乎没有发觉他的存在。大大的报告厅居然拿来强制学生来写感谢信。有够好笑。 梦里还有小赵，看来是真爱了。 遂记录下来。","link":"/2025/07/02/%E6%A2%A6%E5%A2%83%E8%AE%B0%E5%BD%95/"},{"title":"翼掌柜图像编辑页面的思路","text":"本文来自本人的实习记录。 需求分析：我们能产生的图像需要至少达到以下程度，目前来说，已经可以生成ai图片，嵌入文字，叠放图片。 软件已经实现了上传用户自定义素材，和增加文字描述的基础功能 但是，目前来说，文字没法修改大小，字重，字体，有时候ai生成的构图并不合理，需要调节（如例图，例图的洗衣机被放置在了左侧） 因此，我们对于字体嵌入，需要添加大小，字重，字体选项；对于ai生成的构图，需要调用扩图接口，擦除接口，改写接口（后两者是同一个接口） 不过我不知道开发规范，所以就先瞎写了 思路：Main使用main.html作为主页面，主页面包括了子节点容器（godot的思想），底部栏容器，按钮。使用main.js（反正是个什么后端语言）作为主界面的后端。它负责调用main.html引用了哪些子节点。 子节点子节点实现子功能。 贴纸（stickers）（幻想中）调用微信的表情包api（应该有的），然后如法炮制上传本地图片作为贴纸的代码就可以了。 上传本地图片作为贴纸（upload logo）（已经实现）上传本地图片作为贴纸，已经实现了。 嵌入文字（embedding texts）（已经实现）嵌入文字也已经实现了。生成一个矢量文本框，然后可以对矢量文本框进行旋转，移动，缩放，改色功能。 AI图像抹除（ai eliminate）（幻想中）ai图像抹除已经基本实现了 AI局部重绘（ai regenerate）（幻想中）ai局部重绘和ai图像抹除是同一个api，改改post请求参数就可以了 AI扩图（ai expand）（幻想中）这个api不一样，修改构图还是比较重要，有必要做。 实现方法：怎么让html引用子节点（其它html）？ ai回答的 在 HTML 中直接引用其他 HTML 文件（子节点）可以通过以下几种常用方法实现： 方法 1：使用 &lt;iframe&gt;（简单但内容隔离） 特点： 内容独立（样式/脚本不共享） 需手动调整高度（可用 JS 动态调整） 方法 2：JavaScript 动态加载（推荐）使用 fetch() 或 XMLHttpRequest 加载 HTML 内容并插入 DOM： // 动态加载 header.html fetch('header.html') .then(response => response.text()) .then(html => { document.getElementById('header-container').innerHTML = html; }) .catch(error => console.error('加载失败:', error)); 方法 3：HTML5 Web Components（现代标准）使用 &lt;template&gt; 和 &lt;slot&gt; 创建可重用组件： 1. 定义模板组件 (component.html) 网站标题 默认副标题 2. 在主文件中使用 自定义副标题 // 注册自定义组件 const template = document.querySelector('#header-template').import; const headerTemplate = template.querySelector('#my-header'); customElements.define('my-header', class extends HTMLElement { constructor() { super(); const shadow = this.attachShadow({mode: 'open'}); shadow.appendChild(headerTemplate.content.cloneNode(true)); } }); 方法 4：服务端包含（需服务器支持）Apache 示例 (启用 SSI)： 要求： 文件需以 .shtml 结尾 服务器开启 SSI 功能 方法 5：构建工具预处理（工程化方案）使用 Webpack/Parcel 等工具的 HTML 插件： // Webpack 配置示例 (使用 html-webpack-plugin)plugins: [ new HtmlWebpackPlugin({ template: “./src/index.html”, chunks: [“main”] }), new HtmlWebpackPlugin({ filename: “header.html”, template: “./src/parts/header.html” })] ⚠️ 注意事项 跨域问题：动态加载时需确保同源（或配置 CORS） SEO 影响：JS 动态加载的内容可能不被搜索引擎索引 性能：小文件推荐内联，大文件考虑缓存 框架方案： React/Vue/Angular 有专用组件系统 PHP/JSP 等后端语言原生支持 include() 示例目录结构project/├── index.html├── components/│ ├── header.html│ └── footer.html└── scripts/ └── load-components.js 根据项目需求选择最适合的方案，小型项目推荐 JS 动态加载，大型应用推荐 Web Components 或 构建工具集成。 和后端怎么通信？后端脚本之间需要通信吗？大概是需要的。 以下为ai生成 Python Flask 后端脚本间通信实现方式 最简单的是使用数据库。在 Flask 后端应用中，有几种常见的方式可以实现不同脚本或组件之间的通信： 1. 模块导入与函数调用最简单直接的方式是通过 Python 的模块导入机制： # script_a.pydef some_function(): return “Hello from script A” script_b.pyfrom script_a import some_function result = some_function() 2. 使用 Flask 的请求上下文对于需要 HTTP 接口通信的情况： # service_a.pyfrom flask import Flaskapp = Flask(__name__) @app.route(‘/api’)def api_endpoint(): return {“message”: “Hello from Service A”} service_b.pyimport requests response = requests.get(‘http://localhost:5000/api‘)print(response.json()) 3. 消息队列 (RabbitMQ, Redis等)对于异步或解耦的通信： # producer.pyimport pika connection = pika.BlockingConnection(pika.ConnectionParameters(‘localhost’))channel = connection.channel()channel.queue_declare(queue=’hello’) channel.basic_publish(exchange=’’, routing_key=’hello’, body=’Hello from Producer!’) consumer.pyimport pika def callback(ch, method, properties, body): print(f”Received {body}”) connection = pika.BlockingConnection(pika.ConnectionParameters(‘localhost’))channel = connection.channel()channel.queue_declare(queue=’hello’)channel.basic_consume(queue=’hello’, on_message_callback=callback, auto_ack=True)channel.start_consuming() 4. 使用数据库作为中介# writer.pyfrom flask_sqlalchemy import SQLAlchemy db = SQLAlchemy() class Message(db.Model): id = db.Column(db.Integer, primary_key=True) content = db.Column(db.String(200)) 写入消息new_msg = Message(content=”Hello from Writer”)db.session.add(new_msg)db.session.commit() reader.pyfrom models import Message messages = Message.query.all()for msg in messages: print(msg.content) 5. 使用 Python 内置队列# shared_queue.pyfrom queue import Queue message_queue = Queue() producer.pyfrom shared_queue import message_queue message_queue.put(“Message 1”) consumer.pyfrom shared_queue import message_queue msg = message_queue.get()print(msg) 6. 使用 Flask 的蓝图(Blueprint)组织代码对于大型应用，可以使用蓝图组织不同模块： # api/__init__.pyfrom flask import Blueprint api = Blueprint(‘api’, __name__) from . import routes api/routes.pyfrom . import api @api.route(‘/endpoint’)def endpoint(): return {“status”: “success”} 选择哪种方式取决于具体需求： 简单同步通信：模块导入或函数调用 需要 HTTP 接口：Flask 路由 异步或解耦：消息队列 数据持久化：数据库 进程间通信：队列或消息代理","link":"/2025/08/01/%E7%BF%BC%E6%8E%8C%E6%9F%9C%E5%9B%BE%E5%83%8F%E7%BC%96%E8%BE%91%E9%A1%B5%E9%9D%A2%E7%9A%84%E6%80%9D%E8%B7%AF/"},{"title":"黄金 黄金","text":"这篇文章最初写于2025-05-15到5-16，深夜聊天产物。已经在QQ里讲了好多次了。 改编自作者真实经历。希望当事人不要打我。 这是一个直男劫的故事。 直男劫的话，是高三时候的事了。但得从高一开始说起。我高一的时候很烂：心态烂，成绩烂，身体素质也烂。毕竟经历过疫情嘛，电脑看多了，确实容易身心不健康。 不过那也是我自甘堕落，懒得找借口了。自然，高一说不上美好，过得很难受。我就一网瘾少年，一开始在重点班，中考和自主招生考的都还不错。但是高一的课程一开启，就不行了。高一下学期分班了，不仅分文理，重点班也洗牌了。我被分到了普通班。然后呢…当时沉迷打游戏嘛，成绩都那样了，不是很抱希望。 但是班里有些家伙学习就非常游刃有余，学有余力。其中一个家伙，就叫他黄金吧，就考的比较好。分班后开学考，他的名字在班里靠前的位置。啊啊…补充一句，我应该说过，我有个想考去北方但是留在广东的兄弟，他就是黄金。他本来想考哈工大的。 黄金君，是一个对我影响很大的人。即便是直男劫，但我还是很喜欢他。 然后我就记住他了。他比较爱展现自己。而我是那种到了陌生环境，一句话也讲不出来的人。当时全班轮流自我介绍，我站在讲台上一句话也说不出来。但他就不一样，特别爱展示自己，说话挺幽默的。所以，阴湿的我特别嫉妒他，刻意躲着别人。 但人总是会寂寞的吧？于是尝试融入男生圈子，总是融入失败。我数学成绩又差，也不打篮球——拜托，那真的很直男——但黄金君就是偷偷带手机、爱穿拖鞋（广东雨天多），不打篮球，说话幽默风趣的人。我嫉妒成绩好、社交好的人。他打羽毛球。我高一下状态奇差无比，他一进门我都会暗暗骂一句“傻逼”，精神癫狂到开始无差别攻击了。 不过呢……在家里的教训下，我也是收了点心的……也是高一下学期，学期末尾，我就和他比较认识了。我们一次偶然的聊天，发现聊的东西都能接上，于是我对他的印象渐渐改观。 毕竟很多时候，错误的印象只需要一两次交流就能解决。 高二上，黄金忽然跟班主任说，要把他的同桌换成我。 他说理由是前同桌抖腿烦人。不过我还是喜滋滋地坐过去了。我跟他关系就不错了，甚至说很好。有时候会一起讨论一些问题，闲聊之类的。那时候可能已经有一点喜欢了吧？毕竟有好感的也可以是朋友。 想起高中生活，好怀念男生之间可以摸来摸去的日子啊。 我高中前两年很压抑自己性取向，尝试催眠自己喜欢女生，但是确实对女生没兴趣。他的同桌换成我后，我自然表现得很好。班里的座位安排是三连桌，黄金坐在中间，我坐他右边，左边是同哥。他是班里的尖子生，老师可能期望他能多带来些正面影响吧。总之，黄金对我挺有好感的，我和他也互动比较多。我和他做同桌的时候，他有时会摸摸我的腿和手，我也会主动摸回去。渐渐地，我和黄金的友情逐渐升温。 一直持续到了高二下吧？应该是高二？班里有个女生英语也很好，全班英语最好的几个人里，我、黄金、还有她（就叫她L吧）都在里面。黄金很爱玩英语，我们有时会一起讨论英语问题。很多人都在围着黄金转，他很有魅力，身材好、学习好、说话幽默……老师也喜欢他。情不自禁嘛，我肯定对黄金有性幻想的。我很仰慕他，享受和他交谈，原先的嫉妒退化成了种子。我和黄金成为了密友。我数学一直很差，而他数学很好。 又是一年全国高联（数学竞赛），我们平行班也有了参赛名额。初赛去了很多优秀的同学，最终黄金入围了。是黄金要求年级给平行班机会的，原本年级只钦定尖子班去。所以我们平行班高一没机会去参加。他去考了市赛，得了市里第40多名，班主任夸他。 我在一旁听着。 我想…… 要是我能像他一样好就好了。 于是我开始学习。 爹妈当时还让我去班主任赚外快的课外班，我在课外班一直很摆。我决心自学后，我把班推掉了。我先买了那本《一数》编写的那个100练什么鬼的。然后开始从头刷，从头开始看那个方法论，然后学题目。虽然还是很菜，但我觉得我在进步。 高二下期末考完，我暑假的时候买了个网课，然后把书桌搬到客厅，用家里的电视来播放网课。我就跟着网课开始过所有的大题。我想在高三开启之前，努力一把。我确实，因为能掌握新知识，学到了新本领而开心，那是很棒的体验。 当然，回归主线。黄金在我家附近的一个补习机构上课，于是，我除了每天雷打不动地坐在电视机前刷题，还会在下午他放学的时候去见他。我等过一个又一个经过的同学，然后遇见他。 “好巧啊你也在这里呀” 然后他妈妈会来接他，我就靠着车和他聊一会儿天，然后目送他回家。有一次他妈妈说，我们为什么说话不看着对方的眼睛？我说…… “要是看的话……就会亲上去了。” 黄金笑了。 我觉得直男也会有的吧，对同性的冲动。 那天晚上我……失眠了。那似乎是我第二次为黄金失眠。满脑子想的都是他……我发现这个感情是喜欢。现在想起来我都有点感动。也是因为黄金爱健身，我在那个暑假也开始健身了。当我学习完，去旁边的体育中心跑几圈，坐在地上休息时，真的感到很满足。广东的夏天并没有那么热，天很蓝，夕阳也很美，生活似乎本该如此。 是啊，我发现这份感情是喜欢……我有点害怕，当时自然是知道“直男劫”这个概念的，但是心跳得很快……这好像是我唯一一次这么心动。炽热强烈的第一份感情。人生又有多少次能为他人失眠呢？我认为我是真的喜欢他。我扯扯头发，在空调房里，裹着薄毯子，挤在床和墙壁的角落睡着了。周围的支撑仿佛是他抱着我。 黄金在那个暑假还有一个任务，他要去英国旅游。 于是，在他启程前往英国的前两天，他最后一次来补习机构。我去见他。 他打车回家，我和他聊天。 车来得有点慢，我不希望车来。我在微信里说我会想他。我陪他看动画，迪士尼的《怪诞小镇》。我和他坐在一个便利店门口，直到晚霞从红色变成青蓝色。然后车到了，他要走了。那是高二到高三的暑假，这是真的很喜欢。我想约他高三暑假去澳大利亚玩，也跟他说了，他也在思考要不要和我一起去。 临行前我说，我会想你的。 我和他站在马路边。 然后我亲在了他脸颊上。 他有点愣住了，坐车离开了。 我看着车离开。 嗯。广东标志的晚霞，还有云……还有广东下午后的燥热……回归线附近特有的晚霞…… 那天晚上，我发信息和他说：“额，亲你有点突然，如果你不喜欢，我道歉。”他过了一会，回复说，没事，他当时也有点懵。然后，他就前往香港，乘机去了英国。他在英国的时候，我算着时差跟他发“中午好”和“下午好”。他在英国忙，还没网络，5G频段也不一样，很少回复我。 然后开学了，高三开学了。黄金还在英国呢，我挺想念他的。当时我没有个人手机，我的微信在我妈妈手机里，我有时候就随意找个借口，偷偷给他发信息。等啊等，开学一周后，黄金回来了。他带了礼物给我。 是一对杯子，还有一条项链，一条手链。 项链和手链是普通的合金，上面有我的名字，虽然是女名。这也是为什么。我的QQ ID不是George。但他还做了一件事，他把他的微信ID改成了“他的名字+George”。 是啊……他太会了…… 收到礼物后，我把礼物的包装袋压平收起来了。戴上项链和手链……嗯……杯子太大了，只能当笔筒了。晚上睡不着，脑子里的幻想被点燃了。我幻想我和他拥抱……亲吻……和性…… 是他让我下定决心好好学习的，是他让我找回健康生活的态度的，是他让我对生活有希望的，是他让我找回考个好学校的梦想的。是啊，我知道他是直男…… 我喜欢他的叛逆，他爱把校服长裤剪短成短裤穿（剪得呲呲拉拉的）。喜欢他的聪明，他学习成绩好。喜欢他的自由，他有手机（唉，高中生）。喜欢他的身体…… 我是不是太露骨了？可是这有错吗？ 他闻起来香香的，我不敢说。我很折磨，晚上失眠。脑子大抵是停不下来了。更何况，他还是我同桌。 于是，在一天周末 我拿我妈妈的手机，向他表白了。 他沉默了，也可能没沉默，我记不清了。 他说：“会有人陪你走到最后，但那个人不会是我。” 不要给txl机会，这是他收获的教训。 “他委婉的拒绝，没能消除我的幻想。一年以来的喜欢，又怎么会因为一句话而停止呢？” 市赛的成绩下来了，他可以去考省赛了。我很嫉妒他…我后悔当初没能一起去参加数学竞赛。毕竟我很怕数学，一听到竞赛就先躲起来了，像那种…夹尾巴小狗一样吧… “他拒绝了我，但是并不阻碍我接近他…这是否又是一种邀约？” 我在脑子里疯狂的幻想…… 在他出发去广州考试之前，我陪他在因为放假而空空宿舍楼刷竞赛题。那天下雨…宿舍楼周围都是树，周围很绿…地上水多，凉凉的。我和他分别坐在宿舍房间对角线的床位。我偷偷看着他，题目写不下。天呢，惠州一中是住宿的。即使没有肢体接触，单纯欣赏肉体应该有的吧？有的。他肌肉很有型，一身腱子肉，很色的。 天暗了，我才离开。当晚我查了广州天气预报，然后提醒他得带伞和备用鞋袜，微信提醒的。 我一个渴望爱的小txl，做着他想对喜欢的人做的事情。我犯错了吗？ 我家里管的严，生活很紧张，但是我和他在一起时候，我会觉得过得很舒服。 那天表白拒绝后，我惶恐地打字，说： “那请你以后…能否不把我推远？” 他说不会。 我嫉妒他，即便他如此宽容我。嫉妒又一次滋长。比高一的时候更甚。我偷偷把每次考试的排名复印下来，然后用记号笔把我和他的名次高光。我很嫉妒，又是嫉妒又是喜爱，这让我很折磨。 我于是有了第二次表白。额，具体内容我忘记了，第二次表白要来的更直接，拒绝的也更直接。我戏称自己跳过了爱人阶段，直接进入亲情阶段，或者是自我安慰吧…高三的高压环境确实能让人做出很有意思的行为。我开始缠着他，吸他身上的味道…他身上总是香香的。亲他的肩膀……想埋在他的颈窝里…总是想往他怀里钻…他不怎么反抗。可能那个时候我已经健身到比他更壮了吧。 我过的很拧巴……在一天晚上，我悄悄崩溃了，哭了一点点。决定不做同桌了。第二天我搬到了教室最前排的单人座。严格的英语老师都没为难我……她可能知道了一点吧？ 我和黄金君的关系并没有破裂，但其实捅破了窗户纸后，确实有一层无形的尴尬。他应该没有，直男不大会有，我猜测。但是我会有，所以我从此有点躲着他……和他说话一直不大对劲，直到Lou君把我们重新聚集在一起。不过那是后话了。 大概是这样的了，我慢慢的不再对他动心了，但我对他的……记忆？却一直在影响我。所以我有点惧怕亲密关系，怕自己爱而不得，也怕别人我不得。 高考把我们考散了。他去了南方科大，我来了北邮，因为南方科大拒绝了我。他也向南方科大拒绝我这件事情表示了惋惜。我想，他还是挺喜欢我这个朋友的。不过我确实也有了持续一两个月的应激期：不想见到他，不想听他名字，也不想看到他的名字。我一直盯着我和他的成绩排名的差距。 应激期间，我很低落。我妈也看出来了，真不好。她查了我的聊天记录，因为我的账号登陆在她的手机上啊……我非自愿不知情的情况下向我妈出柜了。一天我回到家，我妈说有事情问我。我已经隐约猜到了，她的那个表情是只有遇到大事才会有的。她说我是不是和黄金有超越友情的关系。我很崩溃，但也没闹太大。经过这次和我妈的谈话，至少我还是把心放在高考上了。 之后啊，之后那就是刷题，学习，几点一线的生活了。我在新座位有了新的朋友，有了新的社交，一切都是那么好。 故事最后在鸡毛蒜皮里迎来了尾声。高考后我和他联系的不多，我为了忘记这段故事，把他的微信备注设置为了我最讨厌的抽卡游戏。直到大一下，我可能才真正地从那段情感里走了出来。 当然，我和他应该还能是兄弟的，我和他又不坏，不是吗？ 大家都是好人，值得有一个好结局。 E.N.D.","link":"/2025/08/01/%E9%BB%84%E9%87%91-%E9%BB%84%E9%87%91/"}],"tags":[{"name":"职业","slug":"职业","link":"/tags/%E8%81%8C%E4%B8%9A/"},{"name":"思考","slug":"思考","link":"/tags/%E6%80%9D%E8%80%83/"},{"name":"技术","slug":"技术","link":"/tags/%E6%8A%80%E6%9C%AF/"},{"name":"回忆","slug":"回忆","link":"/tags/%E5%9B%9E%E5%BF%86/"},{"name":"梦","slug":"梦","link":"/tags/%E6%A2%A6/"},{"name":"青春","slug":"青春","link":"/tags/%E9%9D%92%E6%98%A5/"},{"name":"人物","slug":"人物","link":"/tags/%E4%BA%BA%E7%89%A9/"}],"categories":[{"name":"生活记录","slug":"生活记录","link":"/categories/%E7%94%9F%E6%B4%BB%E8%AE%B0%E5%BD%95/"},{"name":"实习记录","slug":"实习记录","link":"/categories/%E5%AE%9E%E4%B9%A0%E8%AE%B0%E5%BD%95/"}],"pages":[{"title":"About 关于本网站","text":"这里是我的网络自留地，想到什么写什么，技术笔记、生活流水账、半夜的胡思乱想，或者单纯发发牢骚。内容很杂，想到什么写什么，梦到什么写什么。语文老师说的脚踩西瓜皮，滑到哪里写到哪里。我这个人也差不多这样——一边写着代码做梦ACM金牌，一边举铁想着哪天能站上健美舞台，偶尔还画两笔furry，理想多多，行动少少。 所有文字都只是我某个时刻的念头，过两天自己可能就不认了。如果你觉得有意思，随便看看就好；如果想转载，记得先问我一声（虽然大概率会同意）。 博客是用WordPress搭的，主题是默认主题，服务器用的是免费体验方案。不过能用就行。1G的多媒体库简直用不完。","link":"/about/index.html"},{"title":"Biography 关于我这个人","text":"目前就读于北京邮电大学，苦逼本科生。喜欢furry，敲代码，电子产品，健身……爱好很多，比较杂乱。有个ACM和ICPC的梦想，有个健美比赛的梦想，还有一个做属于自己的游戏的梦想。 是个男的，取向上来说，也喜欢男的。 联系我个人博客网页：https://attenna8.wordpress.com/ 个人Github主页：Attenna 个人邮箱：george_5298@outlook.com","link":"/biography-%E5%85%B3%E4%BA%8E%E6%88%91%E8%BF%99%E4%B8%AA%E4%BA%BA/index.html"}]}